In [17]:
import pandas as pd
import numpy as np

In [6]:
dates = pd.date_range('10-20-2021', periods=3, freq="2D")
dates

DatetimeIndex(['2021-10-20', '2021-10-22', '2021-10-24'], dtype='datetime64[ns]', freq='2D')

In [12]:
dates.weekday

Int64Index([2, 4, 6], dtype='int64')

In [35]:
dates = pd.date_range('10-20-2000', periods=10, freq='QS-OCT')
dates

DatetimeIndex(['2001-01-01', '2001-04-01', '2001-07-01', '2001-10-01',
               '2002-01-01', '2002-04-01', '2002-07-01', '2002-10-01',
               '2003-01-01', '2003-04-01'],
              dtype='datetime64[ns]', freq='QS-OCT')

In [42]:
def return_num():
    return (100 + np.random.randint(-5, 10, 10).cumsum())

In [43]:
df = pd.DataFrame({'count1': return_num(), 'count2' : return_num()}, index=dates)

In [44]:
df.head()

            count1  count2
2001-01-01     102     106
2001-04-01     103     102
2001-07-01     112      98
2001-10-01     107     100
2002-01-01     114     106

In [56]:
df.diff()

            count1  count2
2001-01-01     NaN     NaN
2001-04-01     1.0    -4.0
2001-07-01     9.0    -4.0
2001-10-01    -5.0     2.0
2002-01-01     7.0     6.0
2002-04-01    -1.0     4.0
2002-07-01     5.0     3.0
2002-10-01     2.0     1.0
2003-01-01     1.0     0.0
2003-04-01     7.0     7.0

In [57]:
df.resample('Y').mean()

            count1  count2
2001-12-31  106.00  101.50
2002-12-31  116.25  110.75
2003-12-31  124.50  117.50